adnat-backend/app/controllers/organisations_controller.rb

SELECT "organisations".* FROM "organisations"
---
    def index
        @organisation = Organisation.all

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @organisation = Organisation.find(params[:id])

INSERT INTO "organisations" ("org_name", "hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["org_name", "testyMctesting"], ["hourly_rate", 12.0], ["created_at", "2019-10-26 03:39:15.523697"], ["updated_at", "2019-10-26 03:39:15.523697"]]
---
    def create
        @organisation = Organisation.new(orgs_params)

        if @organisation.save

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "organisations" SET "hourly_rate" = ?, "updated_at" = ? WHERE "organisations"."id" = ?  [["hourly_rate", 11.0], ["updated_at", "2019-11-09 04:30:29.275589"], ["id", 18]]
---
    def update
        @organisation = Organisation.find(params[:id])
        if @organisation.update(orgs_params)

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "organisations" WHERE "organisations"."id" = ?  [["id", 11]]
---
    def destroy
        @organisation = Organisation.find(params[:id])
        @organisation.destroy