adnat-backend/app/controllers/sessions_controller.rb

  def new
    user = User.find_by email: params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "f@f.com"], ["LIMIT", 1]]