adnat-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "asda"], ["last_name", "asdas"], ["email_address", "asasd@3.com"], ["created_at", "2019-10-20 01:24:37.838584"], ["updated_at", "2019-10-20 01:24:37.838584"]]
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "email_address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Jesse"], ["last_name", "Creech"], ["email_address", "jesse@jesse.com"], ["updated_at", "2019-10-19 23:56:03.798354"], ["id", 20]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)