adnat-backend/app/models/user.rb

    def authenticate(id, enteredPassword)
        @user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]